/**
 * Created by web-01 on 2018/8/10.
 */
//////////////////////////////////////// 算术运算符 //////////////////////////////////////////
// 1.取余 —— 取余数
// 获取所有的 偶数：和2取余0；奇数：和2取余1

// 获取1~100之间所有能被3整除的数字：和3取余的结果是0
console.log("取余：" + 3%5); // 3

// 2.自增和自减
var num = 5;

// 2.1 自增
// num++;  // 6

// 先执行打印num，打印之后才会执行加1
console.log("先赋后加：" + num++); // 5

// 上边语句执行后的num是多少
console.log("num++的结果：" + num); // 6

// 2.2 自减
num--; // 4


// 先执行加1，然后在打印num的结果
console.log("先加后赋：" + (++num)); // 6

var a = 1;
console.log(a++  +  ++a); // a=3
console.log(a++  +  ++a  +  a++); // 3 + 5 + 5












